Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator.Reset Method
 Resets the enumerator to the beginning.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Reset()
Public Sub Reset
Implements
IEnumerator.Reset()
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace